; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-7-7-14)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	driver7 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-1 - location
	p0-2 - location
	p0-3 - location
	p1-0 - location
	p1-4 - location
	p2-3 - location
	p4-1 - location
	p4-2 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s3)
	(at driver3 s4)
	(at driver4 s3)
	(at driver5 s3)
	(at driver6 s0)
	(at driver7 s4)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at truck4 s1)
	(empty truck4)
	(at truck5 s1)
	(empty truck5)
	(at truck6 s2)
	(empty truck6)
	(at truck7 s0)
	(empty truck7)
	(at package1 s4)
	(at package2 s4)
	(at package3 s0)
	(at package4 s1)
	(at package5 s0)
	(at package6 s3)
	(at package7 s2)
	(at package8 s0)
	(at package9 s4)
	(at package10 s2)
	(at package11 s4)
	(at package12 s4)
	(at package13 s0)
	(at package14 s1)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(link s0 s1)
	(link s1 s0)
	(link s0 s4)
	(link s4 s0)
	(link s1 s2)
	(link s2 s1)
	(link s2 s0)
	(link s0 s2)
	(link s2 s3)
	(link s3 s2)
	(link s3 s0)
	(link s0 s3)
	(link s4 s1)
	(link s1 s4)
	(link s4 s3)
	(link s3 s4)
)
	(:goal (and
	(at driver1 s3)
	(at driver3 s4)
	(at driver4 s3)
	(at truck1 s3)
	(at truck2 s4)
	(at truck3 s4)
	(at truck4 s4)
	(at truck5 s2)
	(at truck6 s2)
	(at package1 s4)
	(at package2 s4)
	(at package3 s4)
	(at package4 s4)
	(at package5 s2)
	(at package6 s4)
	(at package7 s1)
	(at package8 s3)
	(at package9 s0)
	(at package10 s0)
	(at package11 s0)
	(at package12 s0)
	(at package13 s0)
	(at package14 s1)
	))


)

; plan
1. (board-truck driver1 s0 truck1)
   deleted: (at driver1 s0) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 7 of 23
2. (load-truck s0 package8 truck1)
   deleted: (at package8 s0)
   added: (in package8 truck1)
   goals met: 7 of 23
3. (drive-truck driver1 s0 s3 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   goals met: 8 of 23
4. (load-truck s0 package5 truck7)
   deleted: (at package5 s0)
   added: (in package5 truck7)
   goals met: 8 of 23
5. (board-truck driver6 s0 truck7)
   deleted: (at driver6 s0) (empty truck7)
   added: (driving driver6 truck7)
   goals met: 8 of 23
6. (drive-truck driver6 s0 s1 truck7)
   deleted: (at truck7 s0)
   added: (at truck7 s1)
   goals met: 8 of 23
7. (drive-truck driver6 s1 s2 truck7)
   deleted: (at truck7 s1)
   added: (at truck7 s2)
   goals met: 8 of 23
8. (load-truck s2 package7 truck7)
   deleted: (at package7 s2)
   added: (in package7 truck7)
   goals met: 8 of 23
9. (unload-truck s2 package5 truck7)
   deleted: (in package5 truck7)
   added: (at package5 s2)
   goals met: 9 of 23
10. (drive-truck driver6 s2 s1 truck7)
   deleted: (at truck7 s2)
   added: (at truck7 s1)
   goals met: 9 of 23
11. (disembark-truck driver6 s1 truck7)
   deleted: (driving driver6 truck7)
   added: (at driver6 s1) (empty truck7)
   goals met: 9 of 23
12. (unload-truck s1 package7 truck7)
   deleted: (in package7 truck7)
   added: (at package7 s1)
   goals met: 10 of 23
13. (board-truck driver6 s1 truck4)
   deleted: (at driver6 s1) (empty truck4)
   added: (driving driver6 truck4)
   goals met: 10 of 23
14. (drive-truck driver6 s1 s4 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s4)
   goals met: 11 of 23
15. (unload-truck s3 package8 truck1)
   deleted: (in package8 truck1)
   added: (at package8 s3)
   goals met: 12 of 23
16. (load-truck s3 package6 truck1)
   deleted: (at package6 s3)
   added: (in package6 truck1)
   goals met: 12 of 23
17. (load-truck s4 package9 truck4)
   deleted: (at package9 s4)
   added: (in package9 truck4)
   goals met: 12 of 23
18. (load-truck s4 package12 truck4)
   deleted: (at package12 s4)
   added: (in package12 truck4)
   goals met: 12 of 23
19. (drive-truck driver6 s4 s0 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s0)
   goals met: 11 of 23
20. (unload-truck s0 package9 truck4)
   deleted: (in package9 truck4)
   added: (at package9 s0)
   goals met: 12 of 23
21. (load-truck s0 package3 truck4)
   deleted: (at package3 s0)
   added: (in package3 truck4)
   goals met: 12 of 23
22. (drive-truck driver6 s0 s1 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   goals met: 12 of 23
23. (drive-truck driver6 s1 s4 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s4)
   goals met: 13 of 23
24. (unload-truck s4 package3 truck4)
   deleted: (in package3 truck4)
   added: (at package3 s4)
   goals met: 14 of 23
25. (load-truck s4 package11 truck4)
   deleted: (at package11 s4)
   added: (in package11 truck4)
   goals met: 14 of 23
26. (drive-truck driver6 s4 s0 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s0)
   goals met: 13 of 23
27. (unload-truck s0 package12 truck4)
   deleted: (in package12 truck4)
   added: (at package12 s0)
   goals met: 14 of 23
28. (drive-truck driver6 s0 s1 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   goals met: 14 of 23
29. (load-truck s1 package4 truck4)
   deleted: (at package4 s1)
   added: (in package4 truck4)
   goals met: 14 of 23
30. (drive-truck driver6 s1 s4 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s4)
   goals met: 15 of 23
31. (unload-truck s4 package4 truck4)
   deleted: (in package4 truck4)
   added: (at package4 s4)
   goals met: 16 of 23
32. (drive-truck driver6 s4 s0 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s0)
   goals met: 15 of 23
33. (drive-truck driver6 s0 s2 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s2)
   goals met: 15 of 23
34. (load-truck s2 package10 truck4)
   deleted: (at package10 s2)
   added: (in package10 truck4)
   goals met: 15 of 23
35. (drive-truck driver6 s2 s0 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s0)
   goals met: 15 of 23
36. (unload-truck s0 package11 truck4)
   deleted: (in package11 truck4)
   added: (at package11 s0)
   goals met: 16 of 23
37. (unload-truck s0 package10 truck4)
   deleted: (in package10 truck4)
   added: (at package10 s0)
   goals met: 17 of 23
38. (drive-truck driver6 s0 s1 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   goals met: 17 of 23
39. (disembark-truck driver6 s1 truck4)
   deleted: (driving driver6 truck4)
   added: (at driver6 s1) (empty truck4)
   goals met: 17 of 23
40. (walk driver7 s4 p4-2)
   deleted: (at driver7 s4)
   added: (at driver7 p4-2)
   goals met: 17 of 23
41. (walk driver7 p4-2 s2)
   deleted: (at driver7 p4-2)
   added: (at driver7 s2)
   goals met: 17 of 23
42. (disembark-truck driver1 s3 truck1)
   deleted: (driving driver1 truck1)
   added: (at driver1 s3) (empty truck1)
   goals met: 18 of 23
43. (board-truck driver5 s3 truck1)
   deleted: (at driver5 s3) (empty truck1)
   added: (driving driver5 truck1)
   goals met: 18 of 23
44. (drive-truck driver5 s3 s4 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   goals met: 17 of 23
45. (unload-truck s4 package6 truck1)
   deleted: (in package6 truck1)
   added: (at package6 s4)
   goals met: 18 of 23
46. (drive-truck driver5 s4 s3 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   goals met: 19 of 23
47. (board-truck driver7 s2 truck2)
   deleted: (at driver7 s2) (empty truck2)
   added: (driving driver7 truck2)
   goals met: 19 of 23
48. (drive-truck driver7 s2 s3 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   goals met: 19 of 23
49. (drive-truck driver7 s3 s4 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   goals met: 20 of 23
50. (board-truck driver6 s1 truck5)
   deleted: (at driver6 s1) (empty truck5)
   added: (driving driver6 truck5)
   goals met: 20 of 23
51. (drive-truck driver6 s1 s2 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s2)
   goals met: 21 of 23
52. (disembark-truck driver6 s2 truck5)
   deleted: (driving driver6 truck5)
   added: (at driver6 s2) (empty truck5)
   goals met: 21 of 23
53. (board-truck driver6 s2 truck3)
   deleted: (at driver6 s2) (empty truck3)
   added: (driving driver6 truck3)
   goals met: 21 of 23
54. (drive-truck driver6 s2 s1 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   goals met: 21 of 23
55. (drive-truck driver6 s1 s4 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s4)
   goals met: 22 of 23
56. (walk driver3 s4 p1-4)
   deleted: (at driver3 s4)
   added: (at driver3 p1-4)
   goals met: 21 of 23
57. (walk driver3 p1-4 s1)
   deleted: (at driver3 p1-4)
   added: (at driver3 s1)
   goals met: 21 of 23
58. (board-truck driver3 s1 truck4)
   deleted: (at driver3 s1) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 21 of 23
59. (drive-truck driver3 s1 s4 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s4)
   goals met: 22 of 23
60. (disembark-truck driver3 s4 truck4)
   deleted: (driving driver3 truck4)
   added: (at driver3 s4) (empty truck4)
   goals met: 23 of 23
